{
  "vehicles": [
    {
      "id": 1,
      "Model": "Mercedes-AMG",
      "Make": "GLE 53",
      "Info": "The Mercedes-AMG GLE 53 is a luxurious SUV that pairs a plush, high-tech cabin with a    powerful petrol engine that’s assisted by a performance-boosting hybrid system.",
      "Image": "https://carwow-uk-wp-2.imgix.net/GLE-53-driving-rear.jpg?auto=format&cs=tinysrgb&fit=clip&ixlib=rb-1.1.0&q=60&w=750"
    },
    {
      "id": 2,
      "Model": "Audi",
      "Make": "RS1",
      "Info": "The new RS1 will reportedly be powered by a 280hp version of Audi's turbocharged 2.0-liter four-cylinder unit. To transmit this power to the wheels Audi is developing a new seven-speed dual-clutch automatic gearbox – a six-speed manual unit will probably still be available, however.",
      "Image": "https://i.pinimg.com/236x/0f/2c/f3/0f2cf3f63541be3a89914f7613dcb737.jpg"
    },
    {
      "id": 3,
      "Model": "Mazda",
      "Make": "Atenza",
      "Info": "Engine:2.5L 4 cylinder engine, power output 170hp  and torque output 167lb-ft @4000rpm",
      "Image": "https://www.crotonmotors.com/wp-content/uploads/2019/01/1-1-1024x558.jpeg"
    },
    {
      "id": 4,
      "Model": "Subaru”",
      "Make": "Legacy B4-Sport",
      "Info": "Subaru B4. The B4 model was introduced for the third generation and was a sedan-only model. The RSK featured the familiar DOHC, twin-turbo 2.0 litre engine rated 276 bhp (206 kW) (265 bhp (198 kW) for automatic with manual mode). This results in a 0–60 mph time of 5.2 seconds for the manual and 5.8 seconds for the automatic.",
      "Image": "https://static.carfromjapan.com/spec_cd91b02e-c5d7-4642-8ce4-28ffc4868687_640_0"
    },
    {
      "id": 5,
      "Model": "volkwagens",
      "Make": "golf-R",
      "Info": "Under the Golf R's hood is a turbocharged 2.0-liter inline-four-cylinder that makes 315 horsepower and 310 pound-feet of torque—up from 288 horsepower and 280 pound-feet in the last-generation R. The engine pairs with either a six-speed manual or seven-speed dual-clutch automatic transmission.",
      "Image": "https://www.topgear.com/sites/default/files/cars-car/carousel/2021/02/golf_r-9.jpg?w=976&h=549"
    },
    {
      "Model": "Toyota",
      "Make": "vitz",
      "Info": "The Toyota Vitz comes with a variety of engine as well as transmission options. Vitz is available in 1.0 liters to 1.5 liters engine mated with five-speed manual, six-speed manual and four-speed automatic and CVT transmission. All the engines of Vitz equipped with double overhead cam.",
      "Image": "https://www.mad4wheels.com/img/free-car-images/desktop/7461/toyota-vitz-2011-297786.jpg",
      "id": 11
    },
    {
      "Model": "Toyota ",
      "Make": "lexus ls",
      "Info": "engine in the LS is a twin-turbocharged 3.4-liter V-6 that delivers a silky-smooth 416 horsepower.",
      "Image": "https://hips.hearstapps.com/hmg-prod/images/2023-lexus-ls-101-1670276038.jpg?crop=0.737xw:0.623xh;0.0337xw,0.334xh&resize=1200:*",
      "id": 12
    },
    {
      "Model": "Suzuki",
      "Make": "Jimny",
      "Info": "Maruti Suzuki Jimny is currently available in Petrol engine. The 1462 cc Petrol engine generates a power of 103.39bhp@6000rpm and a torque of 134.2Nm@4000rpm. Maruti Jimny is available in both Manual & Automatic transmission. Maruti Jimny has a boot space of 208 Liters litres and ground clearance of 210 mm.",
      "Image": "https://www.suzukimalaysia.com/images/jimny-home-sm.jpg",
      "id": 13
    },
    {
      "Model": "truck",
      "Make": "ram",
      "Info": "A longtime titan in the full-size truck segment, the 2023 Ram 1500 delivers even more innovation and capability than previous model years. With four powerful engines to choose from, a wide array of state-of-the-art technologies, and innovative bed features, you’ll feel confident behind the wheel of the Ram 1500. Learn more about this dynamic pickup truck with assistance from the team at Petersen Chrysler Dodge Jeep Ram.",
      "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTvvkxFrJtuSJz0tB3nVBYC8bQ3E9xBZT67eiVeQCT5gIBsGNG2lQAjm54po2vt1ZC6_N4&usqp=CAU",
      "id": 14
    },
    {
      "Model": "Ford",
      "Make": "Ranger Wildtrak",
      "Info": "The Wiltrak X is exclusively available with the bi-turbo 2.0-liter four-cylinder diesel producing 201 hp (150 kW / 204 PS) and 500 Nm (369 lb-ft) of torque. This means it doesn’t get the more powerful 3.0-liter V6 turbodiesel which is optional in the Wildtrak and standard in the Platinum. Power is transmitted to all four wheels through a 10-speed automatic gearbox with the help of the full-time 4WD system.",
      "Image": "https://www.carscoops.com/wp-content/uploads/2023/03/Ford-Ranger-Wildtrak-X-12s.jpg",
      "id": 15
    },
    {
      "Model": "chevrolet",
      "Make": "silverado",
      "Info": "The standard TurboMax™ engine is making believers out of diesel and V8 lovers alike. This powerful engine offers more torque than the Ford 2.7L EcoBoost (430 lb.-ft. of torque compared to 400 for the Ford 2.7L) and combines impressive power with uncompromising durability. Torque on demand is delivered by the unique dual volute turbocharger, giving you effortless power and excellent capability to take on the heavy-duty towing jobs with ease.",
      "Image": "https://www.chevrolet.com/content/dam/chevrolet/na/us/english/retail/may-2023/phase-1/movs/23-mov-sl1500-sia-2048x1024.jpg?imwidth=600",
      "id": 16
    }
  ]
}